views/buy/addr.php

            ],
            //'cc_id',
            //'c_id',
            [
                'label' => '图片',
                'enableSorting' => false,
                'format' => 'raw',
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    return Html::img('images/medicine/'.$medicine->img, ['alt' => $medicine->name, 'width' => '80']);
                },
                'headerOptions' => ['style' => 'text-align:center', 'width' => '80'],
                'contentOptions' => ['align' => 'center'],
            ],
            [
                'label' => '药品名称',
                'enableSorting' => false,
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    $medicineTypeId = $medicine->type;
                    if($medicineTypeId == 1) {
                        \app\models\BuyStatus::$hasRx = true;
                    }
                    return $medicine->name;
                },
                'headerOptions' => ['style' => 'text-align:center', 'width' => '200'],
                'contentOptions' => ['align' => 'center', 'width' => '200'],
            ],
            [
                'label' => '价格',
                'enableSorting' => false,
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    return $medicine->money;
                },
                'headerOptions' => ['style' => 'text-align:center'],
                'contentOptions' => ['style' => 'text-align:center'],
            ],
            //'cc_medicine',
            [
                'label' => '数量',
                'enableSorting' => false,
                'value' => function($model) {
//                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
//                    \app\models\BuyStatus::$totalAmount += $medicine->money * $model->cc_num;
                    return $model->cc_num;
                },
                'headerOptions' => ['style' => 'text-align:center', 'width' => '50'],
                'contentOptions' => ['style' => 'text-align:center', 'width' => '50'],
            ],
---
SELECT * FROM `medicine` WHERE `m_id`=0