views/buy/cart.php

SELECT * FROM `medicine` WHERE `m_id`=0
---
        'columns' => [
            //'cc_id',
            //'c_id',
            [
                'label' => '图片',
                'enableSorting' => false,
                'format' => 'raw',
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    return Html::img('images/medicine/'.$medicine->img, ['alt' => $medicine->name, 'width' => 80]);
                },
                'headerOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle'],
                'contentOptions' => ['style' => 'vertical-align: middle; font-size: xx-small', 'align' => 'center'],
            ],
            [
                'label' => '药品名称',
                'enableSorting' => false,
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    return $medicine->name;
                },
                'headerOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle; width: 150px'],
                'contentOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle; width: 150px'],
            ],
            [
                'label' => '价格',
                'enableSorting' => false,
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    return $medicine->money;
                },
                'headerOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle'],
                'contentOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle'],
            ],
            //'cc_medicine',
            [
                'label' => '数量',
                'enableSorting' => false,
                'value' => function($model) {
                    $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                    \app\models\BuyStatus::$totalAmount += $medicine->money * $model->cc_num;
                    return $model->cc_num;
                },
                'headerOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle; width: 45px'],
                'contentOptions' => ['style' => 'text-align:center; font-size: xx-small; vertical-align: middle; width: 45px'],
            ],

SELECT * FROM `medicine` WHERE `m_id`=0
---
                        return Html::a('增加', ['buy/cart', 'medId' => $model->cc_medicine, 'operation' => 0],
                            ['class' => "btn btn-sm btn-success",
                            'style' => 'font-size:xx-small']);
                    },
                    'sub' => function ($url, $model) {
                        //$_SESSION['medId'] = $model->m_id;
                        return Html::a('减少', ['buy/cart', 'medId' => $model->cc_medicine, 'operation' => 1],
                            ['class' => "btn btn-sm btn-primary",
                            'style' => 'font-size:xx-small; margin-left:5px']);
                    },
                    'delete' => function ($url, $model) {
                        //$_SESSION['medId'] = $model->m_id;
                        return Html::a('删除', ['buy/cart', 'medId' => $model->cc_medicine, 'operation' => 2],
                            ['class' => "btn btn-sm btn-danger",
                                'style' => 'font-size:xx-small; margin-top:5px']);
                    },
                    'buy' => function ($url, $model) {
                        $medicine = \app\models\Medicine::findOne(['m_id' => $model->cc_medicine]);
                        $mMoney = $medicine->money * $model->cc_num;
                        return Html::a('购买', ['buy/addr', 'cart' => $model->cc_id, 'mMoney' => $mMoney],
                            ['class' => "btn btn-sm btn-default",
                                'style' => 'font-size:xx-small; margin-left:5px; margin-top: 5px']);
                    },
                ],